let money = +prompt("Ваш бюджет на месяц?", ''),
    time = prompt('Введите дату в формате YYYY-MM-DD', '');
//------------------------------------------------------------------------------------------------------------------------------

let appData = {
    budget: money,
    expenses: { // объект с обязательными расходами
        // a: b; х2 раза, т.к цикл проходит 2 раза см.16 строку
    },
    optionalExpenses: {}, // объект с необязательными расходами
    income: [], //массив данных с доп. доходом
    timeData: time,
    savings: false // накопления

};

//------------------------------------------------------------------------------------------------------------------------------

for (let i = 0; i < 2; i++) {
    let a = prompt("Введите обязательную статью расходов в этом месяце", ''), // на что будете тратить деньги в этом месяце
        b = prompt("Во сколько обойдется?", ''); // сколько будем тратить в этом месяце

    if (typeof(a) === 'string' && typeof(a) != null && typeof(b) != null && a != '' && b != '' && a.length < 50) { // не даем пользователю отправить пустую строку и т.д. и т.п.
        appData.expenses[a] = b; // передаем значения в  объект expenses который находится в объекте appData(объект в объекте)
    } else {
        i -= 1;
    }

};
//------------------------------------------------------------------------------------------------------------------------------
/* Практикуюсь в написании других циклов
let i = 0;
while (i < 2) {
    let a = prompt("Введите обязательную статью расходов в этом месяце", ''),
        b = prompt("Во сколько обойдется?", ''); 
    if (typeof(a) === 'string' && typeof(a) != null && typeof(b) != null && a != '' && b != '' && a.length < 50) { 
        appData.expenses[a] = b;
    } else {
        
    }
    i++;
};

let i = 0;
do {
    let a = prompt("Введите обязательную статью расходов в этом месяце", ''),
        b = prompt("Во сколько обойдется?", '');
    if (typeof (a) === 'string' && typeof (a) != null && typeof (b) != null && a != '' && b != '' && a.length < 50) {
        appData.expenses[a] = b;
    } else {

    }
    i++;
} while (i < 2);
*/

//------------------------------------------------------------------------------------------------------------------------------

appData.moneyPerDay = appData.budget / 30 // формула расчета бюджета на 1 день. Весь бюджет делим на 30 дней(месяц)

//------------------------------------------------------------------------------------------------------------------------------

alert(`Ежедневный бюджет: ${parseInt(appData.moneyPerDay)}`); // Выводим ежедневный бюджет и округляем его до целого числа 

//------------------------------------------------------------------------------------------------------------------------------

if (appData.moneyPerDay < 1000) {
    console.log(`Минимальный уровень достатка`);
} else if (appData.moneyPerDay > 2000) {
    console.log(`Средний уровень достатка`);
} else if (appData.moneyPerDay > 5000) {
    console.log(`Высокий уровень достатка`);
} else {
    console.log(`Что-то пошло не так!`);
}

//------------------------------------------------------------------------------------------------------------------------------